import numpy as np
import matplotlib.pyplot as plt

fig = plt.figure(figsize=(6, 4))
ax = fig.add_subplot()

def to_cat(a):
    for i in a:
        if a[i] > 1:
            a[i] = 2
        else:
            a[i] = 1
    return a

was = to_cat({'аптеки': 2.0681341323941957, 'рестораны': 2.01997616558181, 'одежда_и_обувь': 2.2093409526539243, 'автоуслуги': 2.506924242464986, 'супермаркеты': 0.9597325278700365, 'такси': 1.2643240695971807, 'красота': 1.494908284552979, 'развлечения': 1.5462770834468618, 'жд_билеты': 2.471745514213426, 'образование': 2.1788572001149635, 'дом_и_ремонт': 0.801719915097952, 'спорттовары': 1.762281461383755, 'животные': 1.6472171710532537, 'цветы': 0.9381610110618431, 'фастфуд': 0.042375274883844675, 'каршеринг': 1.2857503499624807, 'аренда_авто': 0.4641838868218006})
become = {0: {'аптеки': 1.7943838396312464, 'рестораны': 2.275018839539794, 'одежда_и_обувь': 2.3879970270749546, 'автоуслуги': 2.4478492342895697, 'супермаркеты': 0.6625025865030169, 'такси': 1.740673656696972, 'красота': 1.311161929432082, 'развлечения': 1.6812026172609922, 'жд_билеты': 2.1860790902147977, 'образование': 7.185535830727692, 'дом_и_ремонт': 1.010131084855548, 'спорттовары': 2.0853717196214268, 'животные': 1.3972642700986702, 'цветы': 0.9905342308343906, 'фастфуд': 0.062338881870893835, 'каршеринг': 1.527526250890806, 'аренда_авто': 0.0}, 1: {'аптеки': 1.8622649872259935, 'рестораны': 1.9493097546656473, 'одежда_и_обувь': 2.205140252888194, 'автоуслуги': 2.4996147831175217, 'супермаркеты': 0.9188618911599226, 'такси': 1.2219443904378504, 'красота': 1.4530957623580594, 'развлечения': 1.5478877443228907, 'жд_билеты': 2.4638483722305624, 'образование': 1.6929825534617662, 'дом_и_ремонт': 0.7609308568450597, 'спорттовары': 1.4747743711454877, 'животные': 1.6436487113922225, 'цветы': 0.9096919137788937, 'фастфуд': 0.041280905730441214, 'каршеринг': 1.1333302014516584, 'аренда_авто': 0.2776191748687172}, 2: {'аптеки': 2.6770112729048416, 'рестораны': 2.159812599162238, 'одежда_и_обувь': 2.1939626511464843, 'автоуслуги': 2.755569765040473, 'супермаркеты': 1.1604081677323452, 'такси': 1.0527813596061595, 'красота': 1.7224225156972428, 'развлечения': 1.4228613486749915, 'жд_билеты': 2.4422903036241124, 'образование': 2.27734174709173, 'дом_и_ремонт': 0.895957251403898, 'спорттовары': 1.4370980971562137, 'животные': 1.4923309837505858, 'цветы': 1.0399710444470338, 'фастфуд': 0.02051692080098215, 'каршеринг': 1.755480657128329, 'аренда_авто': 1.3798288384745472}, 3: {'аптеки': 3.9181734134214152, 'рестораны': 2.5325106955064003, 'одежда_и_обувь': 2.420764466491243, 'автоуслуги': 3.2224097953256323, 'супермаркеты': 1.1828171933571203, 'такси': 1.4291468390387116, 'красота': 1.4401791686704686, 'развлечения': 2.2359812954965443, 'жд_билеты': 4.797347360387162, 'образование': 4.736275643305948, 'дом_и_ремонт': 0.8385837577782219, 'спорттовары': 3.3074326132178546, 'животные': 1.3389799383207108, 'цветы': 0.8439174665450168, 'фастфуд': 0.06469693114041888, 'каршеринг': 1.592426659499606, 'аренда_авто': 0.0}, 4: {'аптеки': 2.262235545345266, 'рестораны': 2.340630689975843, 'одежда_и_обувь': 3.5401291470706315, 'автоуслуги': 1.9664404469628372, 'супермаркеты': 1.8533204373463315, 'такси': 0.8058060879368658, 'красота': 0.260369580154052, 'развлечения': 7.8349794220132605, 'жд_билеты': 2.1466864327678032, 'образование': 4.566015791004048, 'дом_и_ремонт': 1.806706516730928, 'спорттовары': 3.5266372682139386, 'животные': 0.47834347480038, 'цветы': 0.4017571356040705, 'фастфуд': 0.0, 'каршеринг': 0, 'аренда_авто': 0}}
selected_categories = {0: ['аптеки', 'развлечения', 'жд_билеты', 'одежда_и_обувь', 'красота', 'цветы', 'рестораны', 'такси', 'спорттовары', 'образование'],
                       1: ['аптеки', 'развлечения', 'красота', 'одежда_и_обувь', 'рестораны', 'жд_билеты', 'цветы', 'спорттовары', 'автоуслуги', 'образование'],
                       2: ['аптеки', 'развлечения', 'красота', 'рестораны', 'одежда_и_обувь', 'жд_билеты', 'цветы', 'спорттовары', 'автоуслуги', 'образование'],
                       3: ['аптеки', 'развлечения', 'красота', 'цветы', 'жд_билеты', 'рестораны', 'одежда_и_обувь', 'спорттовары', 'автоуслуги', 'образование'],
                       4: ['аптеки', 'рестораны', 'развлечения', 'автоуслуги', 'цветы', 'животные', 'одежда_и_обувь', 'супермаркеты', 'красота', 'жд_билеты']}
groups = ['14-24', '25-40', '41-56', '57-75', '76+']
for i in become:
    print(i)
    print("\n".join(selected_categories[i]).replace("_", " "))
