a = {'аптеки': 2.0681341323941957, 'рестораны': 2.01997616558181, 'одежда_и_обувь': 2.2093409526539243, 'автоуслуги': 2.506924242464986, 'супермаркеты': 0.9597325278700365, 'такси': 1.2643240695971807, 'красота': 1.494908284552979, 'развлечения': 1.5462770834468618, 'жд_билеты': 2.471745514213426, 'образование': 2.1788572001149635, 'дом_и_ремонт': 0.801719915097952, 'спорттовары': 1.762281461383755, 'животные': 1.6472171710532537, 'цветы': 0.9381610110618431, 'фастфуд': 0.042375274883844675, 'каршеринг': 1.2857503499624807, 'аренда_авто': 0.4641838868218006}
pos = []
net = []
neg = []
for i in a:
    if a[i] >= 1.5:
        pos.append(i)
    elif a[i] >= 0.8:
        net.append(i)
    else:
        neg.append(i)
print(", ".join(pos))
print(", ".join(net))
print(", ".join(neg))